{"1": [{"Title": "新種殭屍網路病毒Hakai來襲，鎖定D-Link、Realtek與華為路由器 ", "Summary": " Hakai為稍早流行的殭屍網路程式Qbot變種，鎖定網路上使用預設密碼或簡單密碼的路由器，開採遠端指令執行漏洞，研究人員發現攻擊已在網路上蔓延，入侵華為、瑞昱、友訊等路由器。  ", "Content": "", "URL": "https://www.ithome.com.tw/news/125682"}, {"Title": "新版Mega擴充套件遭駭，駭客能竊取Chrome使用者的加密貨幣 ", "Summary": " 網站服務廠商自己發行的瀏覽器擴充套件，也難保遭到有心人士植入惡意內容，竊取個資，甚至進一步，想要偷取受害人的加密貨幣錢包。根據一名門羅幣開發者發現，最近Mega為Chrome推出新的3.39.4版擴充套件中，含有竊取使用者的特定網站帳密，以及加密貨幣錢包的私鑰程式碼，經通報後Google已經緊急下架。  ", "Content": " 瀏覽器的擴充套件出現漏洞，外洩瀏覽器儲存的使用者個人資料時有所聞，但除了使用者存取各個網站服務的帳號、密碼，駭客甚至進一步想要對受害者的加密貨幣錢包下手。這樣的情況，以往大多是出現在來路不明的擴充套件，不過，現在即使是網站服務廠商推出的軟體，也要小心可能被駭客竄改。根據一名化名為SerHack的義大利門羅幣開發者在推特上指出，知名的雲端檔案儲存服務廠商Mega，才剛發布新版（3.39.4）的Chrome專用擴充套件，程式碼疑似遭駭客竄改，被發現截錄多個網站密碼的內容，而且會竊取使用者的加密貨幣錢包私鑰憑證，Google接獲通報之後，已經緊急下架處理。根據這名門羅幣的開發者指出，上述新版的Chrome擴充套件，會截取使用者存放在瀏覽器裡的帳號與密碼，包含了Google、微軟、Amazon，以及GitHub等網站的身分驗證資料。而且截取這些資料之後，會傳送到 hxxxs://www.megaopac dot host/。根據SerHack截錄的擴充套件程式碼片段，裡面會存取使用者在特定網站的帳號與密碼，在圖中，包含了微軟網站（login.live.com）、GitHub（github.com/session），以及Google（accounts.google.com）等。（圖片來源：SerHack推特）值得留意的是，除了知名網站的帳號與密碼之外，SerHack表示，這個疑似被駭客竄改的擴充套件，還會竊取使用者的門羅幣與以太幣錢包的私鑰憑證，換言之，使用者不光是身分外洩，還可能因此直接面臨虛擬貨幣的財產損失。不過，稍微值得慶幸的是，這樣的問題，只有出現在Chrome專屬套件，Firefox版本並未遭到竄改。而對於這個有問題的擴充套件，Mega尚未對此做出回應。在Mega的網站上，我們仍看到Chrome版擴充套件下載連結，然而實際點選，則會出現404頁面。", "URL": "https://www.ithome.com.tw/news/125681"}, {"Title": "微軟資安長現身說法，面對現今威脅，雲端服務安全需聚焦4大面向 ", "Summary": " 關於微軟在安全方面的發展，該公司全球資安技術長Diana Kelly表示，微軟主要將安全建構在他們所提供的產品與服務之上，並從身分識別與存取管理、資料保護、威脅防護，與安全性管理，這4大面向來著手。  ", "Content": " 積極擁抱雲端的微軟，在各雲端大型業者中，對其產品服務安全性的重視程度，算是數一數二，因為他們遭受駭客攻擊的次數，可是僅次於美國國防部。關於微軟是如何建構安全的環境，今日（4日）在臺舉行的2018年度微軟資安大會上，該公司全球資安技術長Diana Kelly，也在現場說明了微軟對於自家產品與服務的安全策略。面對雲端服務、行動應用等環境變化，以及各式癱瘓企業基礎架構的網路攻擊，加上嚴格的法規遵循等，現在我們面對的資安問題，已經不同於以往。對於現今網路環境的挑戰，Diana Kelly指出了4個安全趨勢，同時也說明了必須的防護策略。她指出，在身分識別方面的攻擊，今年成長了3倍，因此做好身分驗證與存取管控，相當重要；再者，企業資料仍是最吸引攻擊者的目標，要能隨時隨地做到保護；第三，鑑於96%的惡意軟體是自動變種，防護上要更快地檢測攻擊並自動響應；另外，他們收到多數企業回報，內部使用了超過60個安全解決方案，因此他們認為，要有工具能整合安全調查並提供具體因應方針。 萬物聯網的時代，資安成為企業關注焦點，微軟全球資安技術長Diana Kelly從數位轉型與全球威脅情況談起，說明現在企業需要面臨的挑戰與防護策略。（攝影／羅正漢）而從網路威脅現況來看，在微軟最新的安全情報報告（第23回）中，說明了前三大威脅是殭屍網路、社交郵件與勒索軟體。對於上述威脅態勢，Diana Kelly也藉此提到了微軟本身的資安能量，例如，關於殭屍網路的威脅，微軟去年底從44,000個樣本分析Gamarue殭屍網路的生態系，發現該殭屍病毒在全球擁有1214個C&C伺服器，並建立了464個不同的殭屍網路，涉及逾80個惡意程式家族，因此，他們去年底積極與歐美政府執法機構合作，摧毀了主導Gamarue殭屍網路的成員與建立的基礎架構。關於微軟在資安方面的能量，Diana Kelly表示，微軟安全研究人員從44,000個樣本分析Gamarue殭屍網路的生態系，發現它發展出464個殭屍網路，在全球共有1214個C&C伺服器，他們去年底便與全球多國執法單位合作，共同瓦解Gamarue殭屍網路的危害。（攝影／羅正漢）關於勒索軟體方面，在企業關注的WannaCry與Petya之外，她指出，去年底還有一個名為Bad Rabbit的勒索軟體，大家可能感到陌生，因為這個勒索軟體在40分鐘內，就被他們發現並阻擋，而這主要是利用Windows Defender防毒使用分層機器學習的防禦方式。當然，她也提到今年的勒索軟體威脅有降低的趨勢，取而代之的是惡意挖礦的攻擊。雲端服務安全聚焦四大重點：身分識別與存取管理、資料保護、威脅防護與安全性管理對於微軟服務體系的安全，是如何建構而成，簡單來說，可以分成三個層面：情報、平臺與合作伙伴。Diana Kelly也逐一解釋這三個層面與微軟服務間的關聯。她並指出，微軟在安全上的作法，不僅是保護微軟本身的資料安全，並要將安全建構在他們所提供的產品與服務，才能更進一步協助企業用戶保護其資料、系統與設備。首先，在情報能力上，透過微軟本身服務的廣泛性，彙整全球Windows裝置、電子郵件、認證、網址的威脅情資。而對於如何應用情報去保護資料安全，作法上，只有防護也不足夠，他們同時也強調了偵測和回應的配合。而為了協助企業資料保護與風險管控，微軟也是不斷強化整體雲端平臺的安全性，產品及服務內建的資安防護功能，就是重點。Diana Kelly指出，主要可以畫分成4大面向，分別是身分識別與存取管理、資料保護、威脅防護與安全性管理。因此，關於這些資料保護，微軟也已經提供了各式功能與機制，幫助企業用戶去做到更好的安全管控。​微軟全球資安技術長Diana Kelly表示，要將安全建構在他們所提供的產品與服務，主要側重在4大面向，包含身分識別與存取管理、資料保護、威脅防護與安全性管理，因此，微軟也在這些面向提供多種功能與機制。例如，在身分識別與存取管理方面，包括Windows Credential Grard、Azure Active Directory，以及Windows Hello與條件式存取等。不過，Diana Kelly也坦承，網路安全是一個很難的題目，因此在微軟的產品服務上，也結合了各式各樣的合作夥伴，以強化平臺安全性。舉例來說，上述的4大安全面向，其實都有對應的資安業者，為企業帶來更多幫助。像是在身分識別與存取管理有RSA、Trusona等，為企業提供不同身分認證技術，在威脅保護機制上，可以結合像是Check Point、Lookout等資安業者提供的安全防護，在安全性管理的面向，也有Splunk、QRadar、Palo Alto等產品，能與微軟建構的平臺進一步整合。在安全性上，對於微軟提供的產品與服務，除了仰賴自家的情報能力，以及微軟自己在平臺上內建的安全防護，他們也藉助了合作夥伴的力量，從三個層面建構安全體系。整體而言，對於微軟本身的安全防護，他們強調透過人工智慧、機器學習，以及在產品及服務中內建資安防護，加上合作夥伴，以提供更全面的資安防護。不過，上述內建安全防護若與過去相比，到底存在那些差異？Diana Kelly則表示，主要關鍵在於，微軟近年開始投資大量的研發資源，在安全相關專案，每年超過10億美元，此外，他們兩年前也成立了一個團隊，名為Cyber Security Solution Group，能協助他們在現行的安全架構下，提供更具體的資安策略與規畫。此外，關於產品服務的安全問題，我們也注意到微軟本身也有推出漏洞發現獎勵計畫，我們借此機會詢問Diana Kelly，她表示，目前針對各個不同的微軟服務項目，約有10個左右的獎勵計畫。期望藉各界之力，讓微軟產品服務的漏洞，能早期發現並回報給他們，得以即時修補，他們也會提供獎金作為回報，期望促進正向循環。她不僅是舉出Windows相關獎勵計畫，特別的是，她還提到了微軟身分驗證的專案，以及關於推測性執行旁路獎勵（Speculative Execution Side Channel Bounty）的專案等，顯然，這就是他們近一年在安全漏洞上所關注的焦點。微軟近年持續公告新的漏洞發現獎勵計畫，其中最新的兩個專案是關於微軟身分驗證，以及推測性執行旁路的計畫。", "URL": "https://www.ithome.com.tw/news/125676"}, {"Title": "Google擴大打擊冒牌技術支援詐騙廣告 ", "Summary": " 鑑於技術支援詐騙盛行，Google為打擊相關詐騙廣告，未來幾個月內將部署一驗證機制，確保只有合法第三方技術支援業者才能使用其平台來接觸使用者。  ", "Content": " 愈來愈多詐騙廣告冒充合法公司技術支援誘騙使用者上當，Google周一表示將出手整飭。Google產品政策總裁David Graff指出，為防用戶遭誤導性、不適當及不良廣告所害，該公司致力於打擊濫用廣告系統的業者。單單去年Google已移除了32億則違反其廣告政策的廣告，大約是每秒100則。之前Google已經陸續禁止了小額信貸或可轉債等誤導性金融商品廣告，並開發驗證地區鎖匠或戒毒治療中心詐騙廣告的技術。現在Google將把矛頭轉向第三方技術支援業者，而且計畫將範圍擴大到全球。技術支援詐騙廣告通常是結合詐騙歹徒與惡意程式業者，由惡意程式業者寄出詐騙郵件、或在合法網站上植入偽造廣告、藉由Google等搜尋引擎接觸使用者，讓使用者電腦跳出含有客服專線的警告視窗。等不知情的受害者撥打電話後，就由詐騙人士假冒合法業者特別是HP、Dell等電腦商或微軟的客服人員「指導」受害者下載安裝木馬或其他惡意程式，以利未來的竊取銀行密碼或其他惡意行為。美國政府估計去年前9個月已有4萬人投訴遭騙。微軟今年稍早的一份報告顯示，2017年差點及實際因技術支援詐騙訊息受害的人數比前一年成長24%。Google雖然一直以來也和執法機關及政府合作，但是因為發生詐騙行為的地點已經不在Google平台上，因此要辨識合法與詐騙業者難上加難。Google未來幾個月內將部署一種驗證機制，確保只有合法第三方技術支援業者才能使用其平台來接觸使用者。不過Google並未清楚說明驗證機制的細節。但Google承認，這些並不能足以防堵所有歹徒來愚弄其廣告系統，只能提高難度，該公司承諾未來將投入更多資源來防止這類詐騙廣告。", "URL": "https://www.ithome.com.tw/news/125655"}, {"Title": "五眼聯盟：公眾隱私並非絕對，企業有義務依法提供政府請求的資料 ", "Summary": " 澳洲、美國、加拿大、英國和紐西蘭組成的五眼聯盟發表證據和加密司法互助原則，民間企業都有義務向政府提供合法請求的資料，否則政府將會以各種手段強迫執行。  ", "Content": " 澳洲、美國、加拿大、英國和紐西蘭組成的五眼聯盟（Five Eyes），確立了關於證據和加密資料司法原則。相關私人企業有責任在合法的情況下，向政府提供加密證據資料，而為避免侵害公民權利，需要保證資料經過正當程序取得，聲明最後鼓勵服務供應商主動提供合法取得資料的解決方案，且五方政府不應該偏好特定技術。澳洲內政部（Department of Home Affairs）網站發布了五眼聯盟獲取證據和加密資料的原則聲明。聲明提到，雖然加密技術對於數位經濟、安全網路空間、個人隱私、商業以及政府訊息保護非常重要，但也因為加密技術的廣泛使用，其複雜性讓全球政府在打擊犯罪以及維護國家安全上帶來極大的挑戰，許多原本用於保護個人、企業以及政府訊息的加密手段，也被兒童性犯罪者、恐怖分子和有組織犯罪集團利用，以躲避司法調查和起訴。五眼聯盟認為，公民隱私並非絕對，當法院或是獨立權限根據既定法律授權，政府機構應要能夠存取私人資料，而這就如同政府一直以來都在遵循法律的前提下，在必要情況搜查公民房屋、車輛或任何私人物品一樣。不過，現在執法部門合法獲取資料的能力，以及獲取和使用內容能力之間差距越來越大，各國政府都認為這是一個迫切需要解決的問題，因為這將讓法院授權合法存取資料的判決越來越沒有意義，並且持續的破壞民主國家的司法功能。為共同解決這項問題，澳洲、美國、加拿大、英國和紐西蘭所組成的五眼聯盟，互相確立了加密相關原則。首先，各方相互存在責任，合法獲取的加密資料內容驟減並非只是政府的責任，而是攸關所有利害關係成員的共同責任，這包括了訊息、通信技術和服務供應商、設備製造商以及頂級服務提供商等組織。這些組織都受法律約束需要協助政府合法存取資料的要求。再來，程序合法性至關重要，所有政府都應確保對資料提供者所要求的援助，受法治和正當程序規範。政府只能依據法治和正當程序合法存取公民資料，五眼聯盟認為，合法原則無論是在房屋、車輛和個人物品這類財產，抑或是存取電子裝置與通訊上都適用且同等重要，這對於維持民主社會價值非常重要，而且這種合法性存取資料的行為，都要接受獨立機構的監督和司法審查。最後，五眼政府鼓勵訊息和通信技術服務供應商，自願為政府提供他們所營運的產品或服務，合法的資料存取解決方案。而政府不應該偏愛某種特定的技術，相反地，供應商可以創建專用的解決方案，以滿足合法存取資料的需求。聲明的最後也對這些服務供應商喊話，當政府繼續在合法存取資料的需求上受到阻礙，不排除會以技術、執法、立法或是任何可能的手段，以實現獲取資料的目的。", "URL": "https://www.ithome.com.tw/news/125652"}, {"Title": "Android Wi-Fi廣播漏洞可能導致用戶被追蹤 ", "Summary": " 研究人員在Android OS的Wi-Fi廣播功能中發現漏洞，可藉此獲得用戶的手機的MAC位址、BSSID和Wi-Fi的AP網路名稱等資訊，用以追蹤用戶或是發動網路攻擊。  ", "Content": " 安全研究人員發現Android OS的Wi-Fi廣播功能存在漏洞，讓手機上的app可以暗中取得用戶Wi-Fi網路名稱、IP位址及MAC位址等隱私資訊，進而遭到定位或追蹤、甚至網路攻擊。編號CVE-2018-9489的漏洞是位於Android OS中稱為intents的內部系統廣播功能，它能允許OS本身或是上面的app傳送內部系統訊息讓所有app或OS某些功能讀取。Nightwatch Cybersecurity研究人員發現Android OS可經由二個intents，包括WifiManager的NETWORK_STATE_CHANGED_ACTION and WifiP2pManager的WIFI_P2P_THIS_DEVICE_CHANGED_ACTION傳送Wi-Fi連線及網路介面資訊，包括手機的MAC位址、BSSID（Basic Service Set ID）和Wi-Fi的AP網路名稱，以及其他網路資訊如本地IP位址範圍、閘道IP、DNS伺服器位址等。雖然在Android 6以上版本已不再允許透過API讀取到MAC位址，而其他資訊普通情況下也需要經過核准，但是app只要能聽取這些廣播資訊，就能繞過任何權限檢查機制或現有緩解方式而蒐集到用戶個資，因為他們在安裝app時可能已經允許了app權限。其中因為MAC位址並不會改變，又是綁定硬體，因而可用來追蹤、辨識出Android裝置所在。此外，BSSID可以透過查詢BSSID資料庫，像是WiGLE或SkyHook等而用來定位使用者所在位址。如果用戶手機上被安裝了流氓app，也可以用其他資訊來攻擊本地Wi-Fi網路。研究人員相信所有Android裝置都可能受到影響，包括其他分支版本，如Amazon的FireOS。該漏洞已在Android 9 Pie修補，但Google並不打算修補舊有版本，因此升級到Android 9 Pie可能是目前最好辦法。", "URL": "https://www.ithome.com.tw/news/125650"}, {"Title": "家賊難防！研究：43%的安全專家稱可以駭進自己的組織 ", "Summary": " 儘管2/3的組織建立防範內賊的機制，33%的組織可能要花上數周或是好幾個月才會發現，14%的組織也許永遠也不會察覺內賊的存在。  ", "Content": "", "URL": "https://www.ithome.com.tw/news/125643"}, {"Title": "改善隱私選項的CCleaner 5.46出爐了 ", "Summary": " 今年7月釋出的CCleaner 5.45版，因Active Monitoring新增蒐集匿名用戶資訊的新功能，被使用者發現無法關閉這項功能，引發了不小的反彈，官方緊急下架該版本，上周釋出5.46版本，解決可能侵犯用戶隱私的問題。  ", "Content": "", "URL": "https://www.ithome.com.tw/news/125642"}, {"Title": "蘋果App Store規定：所有新程式都要明列隱私政策 ", "Summary": " 或許和歐盟隱私法GDPR上路有關，蘋果規定自10月3日起新提交的程式或更新程式必須明列隱私政策，打破過去只要求提供訂閱服務的行動程式，所有新提交或更新的程式都受到規範。  ", "Content": " 蘋果於上周五（8/31）宣布，自今年10月3日起，所有新提交或更新的程式都必須明列隱私政策，不管是要直接於App Store上架或是透過TestFlight展開外部測試的行動程式都受到此一新的App Store審核原則的規範。過去蘋果只要求那些提供訂閱服務的行動程式制定隱私政策，現在則將範圍擴及所有新提交與更新的程式。根據蘋果App Store的審核原則，所有的行動程式都必須在App Store Connect的元資料欄位或程式中含有隱私政策連結，並清楚說明程式所蒐集的資料，以及如何蒐集及使用；也必須確認與程式共享資料的第三方採用了一致的標準來保障用戶隱私；以及描述保留或刪除用戶資料的相關策略。儘管蘋果目前並未要求App Store中現有的程式都必須符合該規定，但外界相信該規定某種程度仍與今年5月上線的《歐盟通用資料保護規則》（GDPR）有所關聯。", "URL": "https://www.ithome.com.tw/news/125641"}, {"Title": "全民劇透時代之下的媒體衝擊 ", "Summary": " iThome Studio正式開播，透過臉書視訊直播的方式，讓所有關切資安議題的各界人士一起觀看，並且在線上彼此互動  ", "Content": " 最近關注華人影視消息的人，都應該會注意到《延禧攻略》和《如懿傳》這兩齣熱門的清朝宮廷劇，有趣的是，至今我仍沒有完整看過任何一集，卻還是每天從YouTube看到各式各樣的劇情介紹與討論，除了許多中國網路媒體與網友製作影片，就連臺灣的媒體也紛紛加入生產這類內容的行列，我注意到聯合新聞網旗下的噓!星聞、ETtoday星光雲的相關影片，單支最高點閱次數甚至已經破1百萬，擠入該頻道的前十大熱門影片。除了原生、原創的內容之外，近年來，這種被許多人視為二次創作的內容，越來越多，在網路影片最為普遍，在臺灣，最著名的例子，莫過於谷阿莫製作的X分鐘看完一部電影系列影片，不過，也因此頻頻引發侵權爭議，並且促使許多評論電影內容的影片，改採不斷循環播放預告影片的方式來取代。更有一些人，是透過靜態畫面循環播放，以及把講者聲音轉為電腦合成語音的方式，來提出講評。總而言之，許多影視內容的愛好者與娛樂新聞，都在運用這些方式來轉述原本的作品，類似的行為，我們往往稱為劇透（劇情透漏）或爆雷，幾乎成了常態。不過，有時候，觀眾和媒體也難得會謹守分寸，像是《復仇者聯盟3：無限之戰》在電影公司發布藍光光碟之前，在網路上看到的「劇透」很有限，算是一個很特殊的現象。相對地，在其他領域的資訊提供與揭露上，就沒有如此百花齊放的盛況，然而，將原本難以理解的內容，透過影片的方式來呈現，顯然是必要的手段。對於這樣的形式，我們也持續在思考與籌備適合的數位影片內容，並於今年特別設立了影音服務，稱為iThome Studio，並且於7月底正式開播，而這個平臺的第一個節目是《大話資安》，透過臉書視訊直播的方式，讓所有關切資安議題的各界人士一起觀看，並且在線上彼此互動。這個節目的主持人是我們的資安主筆黃彥棻，每集會邀請資安領域的專業人員，一起探討資安界當前的大事。目前已經陸續討論幾個主題，像是全球矚目的法規遵循GDPR、臺灣今年參與DEF CON網路搶旗賽（CTF）的經驗分享，以及出身臺灣的資安廠商趨勢科技的年度資安大會。至於平面雜誌的內容，仍然是我們持續耕耘IT領域各種議題的基礎。不只是報導國內外的IT消息，每一期專題、封面故事的挑選與內容採訪製作，也都是記者、技術編輯、攝影、美術編輯通力合作的成果，就以本期〈NVMe開始邁入主流儲存應用〉為例，雖然訴求的主題較適合關注企業儲存的人士閱讀，而且，也是一個不太容易用圖像呈現內容的技術議題，但從第一頁的圖像選擇上，我們不只是希望傳達NVMe就是提供高速儲存系統的意象，因為基於SAS或SATA介面的全快閃儲存系統，更想突顯NVMe能夠「跨越」不同網路傳輸媒介（光纖通道網路與乙太網路），而且，還要能兼顧「資料儲存系統」的意象。而負責撰寫這次封面故事的技術主筆張明德，也是以圖解、表格整理見長，對於複雜的技術架構、廠商生態體系，他都能有系統地予以呈現，幫助大家了解企業儲存應用的最新趨勢，也是相當難能可貴。總體來說，面對這個資訊爆炸的時代，iThome將會與時俱進，設法替所有閱聽眾，找到更容易理解這些情報的方法，並且對於IT廠商、企業用戶、前端使用者之間，會繼續促進彼此的交流與理解，因此，我們將會保持彈性，敬請拭目以待。", "URL": "https://www.ithome.com.tw/voice/125605"}, {"Title": "Google釋出內部Tink加密軟體函式庫，Google Pay和智慧助理都有用 ", "Summary": " Google開源了內部使用的Tink加密軟體函式庫，特色是不只容易使用，還有許多防呆機制避免函式庫被誤用。  ", "Content": " 不少Google的產品都使用加密技術來保護用戶資料安全，不過，密碼學實作必須非常的小心，只要有一點疏漏，就可能造成嚴重的後果，Google提到，要理解密碼學學術文件之後，再實作成函式庫並非一件容易的事，多數的開發人員沒有多餘的時間資源進行這項工作。因此Google為了幫助自家發展加密服務應用，為開發人員提供了安全的跨平臺加密函式庫Tink。而Tink的設計重點特色在於，易用而且難以被誤用。Google提到，Tink中有許多防呆設計，來減少用戶誤用函式庫，像是如果底層加密模式需要nonce，但重複使用nonce反而造成不安全，Tink就不會允許開發者傳遞nonce。Tink建立在既有的函式庫上，包括BoringSSL和Java Cryptography Architecture，不過，他們在開發Tink的過程，發現了這些函式庫的弱點，因此也順便修補了這些弱點。Tink在介面宣告了例如抵禦選擇密文攻擊等安全屬性，讓安全稽核人員和自動化工具，能快速發現與安全保證不符的安全需求。Tink還為潛在危操作隔離API，使用者無法進行從硬碟載入明文金鑰等行為，Tink提供開發者發現、限制、監控以及紀錄函式庫使用的功能。另外，Tink還可以結合自訂義的加密方法或是內部金鑰管理系統，以便Tink和其他系統無縫協作，Tink的架構非常靈活，每一個部分都可以被移除或是更換，所有元件都是可組合的，開發者可以選擇並與其他元件組裝，當開發者只需要數位簽章功能，那就可以拿掉對稱金鑰加密元件，能夠最大程度減少應用程式的程式碼大小。目前Google的AdMob、Google Pay、Google智慧助理、Firebase以及Android搜尋應用等，都已經使用了Tink。Tink經過兩年的發展，來到了1.2版本，支援雲端、Android和iOS各平臺，現在已經在GitHub開源，而且也已經有外部貢獻者參與開發。", "URL": "https://www.ithome.com.tw/news/125632"}, {"Title": "強化反追蹤技術，Firefox將封鎖拖慢網頁載入速度的第三方追蹤器 ", "Summary": " Mozilla收緊第三方追蹤器在Firefox上的行為政策，未來不只會封鎖拖慢網頁載入速度的追蹤器，連偷偷識別用戶身分的追蹤器也會遭到封鎖。  ", "Content": " Mozilla宣布，在接下來幾個月，Firefox將預設啟用一系列防追蹤功能來保護使用者，另外還提供一組透明的控制元件，讓使用者選擇願意與網站共享的訊息。廣告追蹤會大幅降低網路速度，Mozilla引用Ghostery的研究，提到載入一般網站的總時間，其中有55.4％用於載入第三方追蹤器，對於網路速度原本就較慢的使用者，造成很大的負擔。而較長的頁面載入時間，對於使用者以及網站本身都非好事，Firefox Nightly現在加入了一項新功能，可以阻擋降低頁面載入速度的追蹤器，在9月時將以Firefox的Shield Study機制來測試該功能，一旦測試效果良好，Mozilla將會在Firefox 63正式部署該功能。另外，為了幫助用戶獲得私密的網路瀏覽體驗，Firefox將剝離cookie並阻止第三方追蹤內容的儲存存取，Firefox Nightly的用戶已經可以試用該功能，而Mozilla將在9月，讓Firefox Beta用戶透過Shield Study機制進行測試，目標於正式版Firefox 65上線，提供用戶流暢的上網體驗。Mozilla還提到，追蹤器偷偷的收集用戶可識別資料的行為越來越猖狂，像是廣告追蹤器透過使用者裝置的屬性，以用戶無法控制的方法辨識用戶身分，甚至是在網站上部署加密挖礦腳本，偷偷利用使用者裝置挖掘加密貨幣，而Firefox將在未來預設阻擋這些行為。", "URL": "https://www.ithome.com.tw/news/125633"}, {"Title": "簡化USB儲存裝置安全檢測作業，賽門鐵克推出掃描工作站 ", "Summary": " 杜絕惡意程式從USB儲存裝置感染到個人電腦與生產機臺的可能性，賽門鐵克推出專用的掃描工作站  ", "Content": " 今年8月初，台積電爆發大規模病毒感染事件，僅僅因為安裝新機臺時，一次疏於惡意軟體檢查的程序，而當這臺帶有資安威脅的設備連上廠區的內部網路之後，惡意軟體開始擴散，導致多個臺灣廠區的生產機臺陷入癱瘓，結果造成52億元的損失。而在這次事件落幕之後，對於作業科技（OT）領域的工廠生產系統、工業控制系統的防護，真正開始受到臺灣各界的高度重視。而在賽門鐵克8月底舉行的高科技產業系統安全防護研討會當中，該公司向新竹、臺北的企業正式介紹了他們的解決方案，其中，首度在臺亮相的Industrial Control System Protection（ICSP）引發與會者熱烈討論。因應工業控制系統的UBS裝置存取防護需求，賽門鐵克日前在臺首度介紹他們最新主推的解決方案，稱為Symantec Industrial Control System Protection。該公司物聯網部門總經理Kunal Agarwal也在現場實際展ICSP scanner station設備的使用。攝影／李宗翰基本上，這套解決方案原本是Blue Coat所發展的產品，在2016年賽門鐵克併購該公司之後納入，當中包含了觸控式USB裝置掃描工作站（USB scanning station），以及安裝在OT設備系統當中的政策實施驅動程式（Enforcement Driver），可確保廠區關鍵基礎設施在連接各種USB儲存裝置時，例如隨身碟、記憶卡、光碟機，免於受到潛伏其中的惡意軟體侵襲。一般而言，生產設備機臺、工業控制系統（圖中最右側）並不允許直接插入USB儲存裝置，相關的資料存取，通常需經由提供人機介面的電腦（HMI Computer）來進行，這裡會允許使用USB儲存裝置，同時，執行相關作業的工程師所操作的電腦，也是允許使用USB儲存裝置，因此，若要防備惡意軟體以此作為跳板，攻擊在其背後的生產設備機臺、工業控制系統，就要從這兩個地方來強化威脅的檢測工作。而Symantec Industrial Control System Protection提供了一臺掃描工作站，可協助USB儲存裝置的惡意軟體檢測，確定沒有安全疑慮之後，才能將這些USB裝置安插在人機介面的電腦，以及工程師的電腦。ICSP的使用方式也相當簡便，一般而言，我們必須先將USB儲存裝置插在掃描工作站的設備，透過觸控面板的按鈕來執行掃描作業，確認當中沒有任何惡意程式與檔案，然後，再把這支通過上述安全驗證程序的USB裝置，插在已經安裝ICSP驅動程式的生產設備系統，以便進行檔案存取。若要檢測USB儲存裝置，我們須將它插在ICSP掃描工作站螢幕右下角的USB埠，然後再透過觸控螢幕來操作相關程序，使用起來相當簡便。攝影／洪政偉這是ICSP掃描工作站開機後啟動系統之後的樣子，一般使用者可直接在觸控螢幕提供的主選單，選擇執行三種功能，其中，最常用的項目，當然是最左側的「掃描USB外接儲存裝置」。而中間的按鍵，是讓使用者將目前正插在ICSP掃描工作站的這個USB儲存裝置，轉為惡意軟體的掃描與清理設備。如果你懷疑HMI設備和工作站已經感染了惡意軟體，可以將製作好的設備插在這些電腦上，即可從中執行掃描與清理作業（針對32位元和64位元Windows，ICSP提供各自的清理程式）。至於ICSP掃描工作站螢幕最右邊的按鍵，則是負責產生ICSP驅動程式套件的功能，系統將會在USB儲存裝置裡面，建立一個輕量驅動程式軟體包，之後，可以將這個套件安裝到所要保護的HMI設備和工作站，即可部署所謂的ICSP驅動程式，讓你的電腦可以阻擋未經ICSP設備掃描與驗證的USB裝置。這是ICSP掃描工作站正在執行掃描作業的畫面，根據原廠的文件所示，如果你插入的是帶有密碼保護的USB儲存裝置，系統會要求你輸入正確的密碼，然而，一旦輸入錯誤太多次，超過系統允許範圍，此時，儲存裝置裡面的資料會被自動刪除。經過ICSP掃描工作站的比對，如果偵測的結果顯示已經受到感染，就會在螢幕上出現「Infected」的紅色大字作為警示，接下來，使用者不應該再繼續存取這支USB裝置，若要使用，應該要設法刪除那些已經感染的檔案，也因此，ICSP掃描工作站的螢幕下方會列出4個選項，問你是否要刪除全部檔案、刪除指定檔案、保留指定檔案，或是保留全部檔案。如果出現的是「Partially validated」的黃色字樣，這意味著ICSP掃描工作站並未發現任何已感染的檔案，不過，有些檔案可能因為有密碼保護的關係，而無法掃描，所以，系統如果此時呈現這樣的掃描結果，表示部分未驗證，接下來，我們可以點選「details」的按鈕，檢視詳細狀況。這是一臺已經安裝ICSP驅動程式的筆電，我們插上一支未經ICSP掃描工作站檢測的USB隨身碟，系統隨即跳出拒絕存取的警示。攝影／洪政偉對於沒有通過ICSP檢測的USB儲存裝置，相關的警示畫面會出現在HMI設備或工程師電腦Windows桌面的右下角。如果手上的USB隨身碟通過ICSP掃描，之後，使用者又存放其他檔案進去，而沒重新整支隨身碟讓ICSP掃描工作站檢測，此時，使用者電腦雖然可以插上隨身碟使用，但將無法開啟這些後續新增的檔案，而出現圖中的警示視窗。這是ICSP對於USB裝置的簡易驗證流程示意圖，經過掃描的裝置才能安裝到HMI設備與工程師電腦，讓使用者能夠順利存取當中的檔案；相反地，如果沒有通過掃描程序的任何裝置，即便安裝到這些電腦上，均不能開啟裡面的檔案。此外，ICSP採用的安全掃描技術也值得一提。不只是使用特徵比對的方式，這裡也結合檔案信譽、進階機器學習、沙箱模擬等作法，提升偵測範圍與精準度，以及處理效能，並在近期改版當中，持續擴充相關功能。ICSP運用的惡意軟體掃描技術，包含進階機器學習、信譽評等、特徵比對、沙箱模擬，而且，這些技術的背後，都是由Symantec 安全技術與應變中心（Security Technology and Response，STAR）所支援，該團隊針對檔案、網路、行為、信譽、矯正等五大領域，開發相關的防護創新應用。舉例來說，ICSP 在5.2.1版時，開始支援更多種執行檔格式，像是Windows x64的PE32+、Apple雙位元物件檔 Mach-O、.NET雙位元檔；5.3.1版掃描效能提升了2.5倍、支援加密隨身碟的掃描（金士頓DataTraveler Vault Privacy v2和v3），而在保護的作業系統平臺，也擴及Windows 8、8.1、Server 2012 R2。此外，這一版也支援掃描工作站的離線更新，以及加密金鑰的匯出與匯入（支援多臺掃描工作站一起使用的場景）、ICSP驅動程式狀態監控。之後發布的5.3.6版，可支援檔案白名單、USB介面CD/DVD光碟片與3.5吋軟碟片的檢測。而在今年7月發布的5.4版，ICSP的品牌從Blue Coat正式改為Symantec，並且統一使用Symantec的防毒引擎（5.3.6版之前是Bitdefender，5.3.6版可選用Kaspersky，5.4版起不支援他牌防毒引擎），而且，掃描工作站可將系統本身處理的資訊傳送到指定的syslog伺服器，方便安全事件管理系統（SIEM）或安全管理中心（SOC）進行整合。ICSP掃描工作站的側面如圖中所示，這裡可看到有4個USB埠，其中2個是USB 3.0規格，以及HDMI埠、RJ45埠（一個是網路埠，另一個無作用）。攝影／洪政偉這是ICSP掃描工作站的背部，在實際建置時，從這裡可搭配壁掛或是桌掛套件，以便固定在牆面或桌面上使用。攝影／洪政偉產品資訊Symantec Industrial Control System Protection●原廠：Symantec(02)8729-9277●建議售價：廠商未提供●組成元件：ICSP scanner station設備、ICSP driver驅動程式●硬體設備規格：基於Linux作業系統、5個USB 2.0埠（面板1個，底部4個）、1個網路埠，外型為高265公釐、寬310公釐、深52.6公釐，重量為3.6公斤●驅動程式支援作業系統：Windows XP SP2到Windows 10，Windows Server 2003 SP1到Windows Server 2016【註：規格與價格由廠商提供，因時有異動，正確資訊請洽廠商】", "URL": "https://www.ithome.com.tw/review/125508"}]}